[{"model": "blog.postblog", "pk": 9, "fields": {"title": "Hublot New Ltd. Edition", "preview": "Hublot’s somewhat over-the-top luxury watches have gained a cult following among those like Ferrari heir Lapo Elkann who espouse maximalist style.", "article": "Hublot’s somewhat over-the-top luxury watches have gained a cult following among those like Ferrari heir Lapo Elkann who espouse maximalist style. Subtlety may not be their strong suit, but thanks to a number of high-profile partnerships, most notably in the sports and especially motorsports worlds, their branding as an uncompromising symbol of contemporary luxury has been a big success and no doubt makes parent LVMH very happy.\r\nNot everything they do is motivated by money, however. Their latest limited edition watch project is decidedly philanthropic, created in partnership with Best Buddies, a nonprofit organization dedicated to creating opportunities for friendship, employment and leadership training for people with intellectual and developmental disabilities. Limited to just 100 pieces, the Big Bang Unico Best Buddies Limited Edition is inspired by the world of cycling and designed to be extremely lightweight.", "author": "PAUL ALTIERI", "image": "hublot_bigbang_kwBliWH.jpeg", "blog_source": "https://www.bobswatches.com/rolex-blog/new-releases/hublot-unveils-new-ltd-edition-big-bang-best-buddies-international.html", "source_url": "https://www.bobswatches.com/rolex-blog/new-releases/hublot-unveils-new-ltd-edition-big-bang-best-buddies-international.html", "post_date": "2022-01-20T16:27:50.980Z"}}, {"model": "blog.postblog", "pk": 10, "fields": {"title": "New IWC Portugieser Watches", "preview": "Like all of its sibling brands that make up the Richemont Group’s watchmaking division, IWC also announced its novelties for 2020 via the Watches & Wonders digital rollout.", "article": "Like all of its sibling brands that make up the Richemont Group’s watchmaking division, IWC also announced its novelties for 2020 via the Watches & Wonders digital rollout. This year, IWC chose to focus on expanding the Portugieser collection with new models, ranging from straightforward time-only models to sporty water-ready watches to high-complication timepieces. Here are some of the highlights from the new IWC Portugieser range for 2020.\r\nDrawing inspiration from the original IWC Portugieser ref. 325 from 1939, the new Portugieser Automatic 40 combines a new case size and movement to great effect. Like the very first model named after the two Portuguese businessmen who requested wristwatches with the precision of a marine chronometer, the new IWC Portugieser Automatic 40 features a minimalistic dial layout comprised of Arabic numeral indexes, a chapter ring, a pair of hands at center, and a small seconds sub-dial at 6 o’clock.\r\nWhile the exterior of the watch retains an aesthetic that can be directly linked to one established 80 years ago, inside the compact 40.4mm (12.4mm thick) case is the new in-house Caliber 82200, complete with the famed Pellaton winding system. Offering users a 60-hour power reserve, the new IWC automatic movement can be seen through the sapphire caseback.", "author": "PAUL ALTIERI", "image": "iwc_portugieser_wlKhdYg.jpeg", "blog_source": "https://www.bobswatches.com/rolex-blog/new-releases/new-iwc-portugieser-watches-2020.html", "source_url": "https://www.bobswatches.com/rolex-blog/new-releases/new-iwc-portugieser-watches-2020.html", "post_date": "2022-01-20T16:41:16.614Z"}}, {"model": "blog.postblog", "pk": 11, "fields": {"title": "Omega Seamaster Planet Ocean", "preview": "In 2005, Omega launched a new professional diver’s watch collection dubbed the Seamaster Planet Ocean 600M.", "article": "In 2005, Omega launched a new professional diver’s watch collection dubbed the Seamaster Planet Ocean 600M. Although modern in terms of design, materials, and mechanics, the Omega Planet Ocean models draw inspiration from the brand’s rich legacy of diving watches. Today, the Planet Ocean is Omega’s signature pro dive watch line and in true form, there are plenty of variations available.\r\nIn addition to the core time-and-date models, there are also several other Planet Ocean watches, including both chronographs and GMT versions. Omega first introduced the Seamaster Planet Ocean GMT watch collection in 2013 and then updated the range in 2016. Combining all the capabilities of a true travel watch with the core functionally of a professional diver makes the Omega Seamaster Planet Ocean GMT the perfect go-anywhere, do-anything timekeeping companion. If you’re interested in a luxury dive watch that offers practical GMT functionality, here’s everything you need to know about the Omega Seamaster Planet Ocean GMT.\r\nEight years after the initial 2005 introduction of the Planet Ocean collection, the Omega Planet Ocean GMT made its debut in 2013. The model also introduced a new 43.5mm case size to the lineup, which was in between the existing 42mm and 45.5mm Planet Ocean cases. Similar to other Planet Ocean models, the GMT edition is water-resistant to 600 meters (2,000 feet), includes a manually-operated helium escape valve at 10’clock, and a highly luminous dial.", "author": "PAUL ALTIERI", "image": "omega_seamaster_rHuyyZz.jpeg", "blog_source": "https://www.bobswatches.com/rolex-blog/watch-review/seas-skies-omega-seamaster-planet-ocean-gmt.html", "source_url": "https://www.bobswatches.com/rolex-blog/watch-review/seas-skies-omega-seamaster-planet-ocean-gmt.html", "post_date": "2022-01-20T16:50:24.682Z"}}]